mokeYQL/esp-brookesia/products/Replica_ai/doc/demo_mini/speaker-display-mini/sdkconfig.defaults
# Speaker Display Mini 默认配置
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="0.1.0"

# BSP / LVGL 基本需求
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=20
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y

# 控制台 & 调试
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FreeRTOS/LVGL 建议配置
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y

